/*
  Insert:
    - вставити в табличку котів 1 запис кота
      має містити поля:
        - ім'я
        - порода
        - вік
        - стать
        - масса
    - вставити в табличку котів 4 - 5 записів
      записи мають містити деякі з полів:
        - ім'я
        - порода
        - вік
        - стать
        - масса

  Read:
    Знайти всіх котиків, які:
      - мають породу - 'British'
      - віком більше ніж 7 років та чоловічої статі
      - масою меншою або рівною 6 або без даних про породу

  Update:
    - всім котам породи 'Maine Coon' встановити масу 8 кг
    - всім котам без статі встановити стать кішки

  Delete
    видалити кота з ім'ям 'Vas`ka'
    видалити всіх котів, з масою менше 0
    видалити всіх котів у яких немає даних про масу або про вік
*/